OpenFoam_Cases/Channel_14124_M1/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
100
(
(0.05 0.0025201 0)
(0.05 0.0076821 0)
(0.05 0.0130936 0)
(0.05 0.0187665 0)
(0.05 0.0247136 0)
(0.05 0.0309482 0)
(0.05 0.037484 0)
(0.05 0.0443356 0)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform (0.05 0 0);
    }
    topWall
    {
        type            calculated;
        value           uniform (0.05 2 0);
    }
    sides1_half0
    {
        type            empty;
    }
    sides1_half1
    {
        type            empty;
    }
    sides2_half0
    {
        type            empty;
    }
    sides2_half1
    {
        type            empty;
    }
    inout1_half0
    {
        type            cyclic;
    }
    inout1_half1
    {
        type            cyclic;
    }
    inout2_half0
    {
        type            cyclic;
    }
    inout2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
