OpenFoam_Cases/Channel_14124_M1/0/grad(p)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      grad(p);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottomWall
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
    sides1_half0
    {
        type            empty;
    }
    sides1_half1
    {
        type            empty;
    }
    sides2_half0
    {
        type            empty;
    }
    sides2_half1
    {
        type            empty;
    }
    inout1_half0
    {
        type            cyclic;
    }
    inout1_half1
    {
        type            cyclic;
    }
    inout2_half0
    {
        type            cyclic;
    }
    inout2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
