OpenFoam_Cases/Channel_14124_M1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1;
        startFace       99;
    }
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1;
        startFace       100;
    }
    sides1_half0
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          50;
        startFace       101;
    }
    sides1_half1
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          50;
        startFace       151;
    }
    sides2_half0
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          50;
        startFace       201;
    }
    sides2_half1
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          50;
        startFace       251;
    }
    inout1_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          50;
        startFace       301;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout1_half1;
    }
    inout1_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          50;
        startFace       351;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout1_half0;
    }
    inout2_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          50;
        startFace       401;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout2_half1;
    }
    inout2_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          50;
        startFace       451;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout2_half0;
    }
)

// ************************************************************************* //
